SMP_BankExchange_SMB/cfe/src/Documents/ПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеНаСчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СМП_ИДТранзакцииБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

SMP_BankExchange_SMB/cfe/src/Enums/СМП_ПоддерживаемыеИнтеграцииСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СМП_ПоддерживаемыеИнтеграцииСБанками</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриватБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОНОБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодключаемаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПУМБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NovaPay</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОНОБанкЮр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

SMP_BankExchange_SMB/cfe/src/Catalogs/СМП_УчетныеЗаписиБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СМП_УчетныеЗаписиБанков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМП_ПоддерживаемыеИнтеграцииСБанками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемаяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаДляНовыхКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьНовогоКонтрагентаПриЗагрузкеВыписки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентныеЗадания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДляWebHook</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

SMP_BankExchange_SMB/cfe/src/Documents/ПоступлениеНаСчет/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура СМП_ПолучитьДанныеСНовопейПослеНаСервере()
	СтрРеестр = "реєстру № ";
	ПозНачала = Найти(Объект.НазначениеПлатежа, СтрРеестр) + СтрДлина(СтрРеестр);
	ОстатокСтроки = Сред(Объект.НазначениеПлатежа, ПозНачала);
	ПозКонца = Найти(ОстатокСтроки, " ");
	НомерРеестра = СокрЛП(Лев(ОстатокСтроки, ПозКонца));
	
	УчетнаяЗаписьБанка = Справочники.СМП_УчетныеЗаписиБанков.НайтиПоРеквизиту("БанковскийСчет", Объект.БанковскийСчет);
	ДанныеРеестра = СМП_РаботаСБанкамиNovaPayAPIСервер.ПолучитьДанныеРеестра(УчетнаяЗаписьБанка, Объект.Дата, НомерРеестра); 
	
	Если ТИПЗНЧ(ДанныеРеестра) = ТИП("ТаблицаЗначений") Тогда
		Для каждого строка из ДанныеРеестра Цикл
			СтрокаРасшифровкаПлатежаОтАгента = Объект.РасшифровкаПлатежаОтАгента.Добавить();
			СтрокаРасшифровкаПлатежаОтАгента.Заказ = НайтиЗаказПокупателя(строка);
			РасшифровкаПлатежаОтАгентаЗаказПриИзмененииНаСервере(СтрокаРасшифровкаПлатежаОтАгента.ПолучитьИдентификатор());
			СтрокаРасшифровкаПлатежаОтАгента.ПолученоОтКлиента = строка.СумаПрийнятих;
			СтрокаРасшифровкаПлатежаОтАгента.УдержаноАгентом = строка.СумаУтриманої;
			СтрокаРасшифровкаПлатежаОтАгента.СуммаПлатежа = строка.СумаПерерахованих;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиЗаказПокупателя(Данные)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	НЕ ЗаказПокупателя.ПометкаУдаления
	               |	И ЗаказПокупателя.Номер = &Номер";
	Запрос.УстановитьПараметр("Номер", Данные.НомерЗамовлення);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ЗаказПокупателя.ПустаяСсылка();
КонецФункции

&НаСервере
Функция ОбновитьВидимость()
	УчетнаяЗаписьБанка = Справочники.СМП_УчетныеЗаписиБанков.НайтиПоРеквизиту("БанковскийСчет", Объект.БанковскийСчет);
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьБанка) И УчетнаяЗаписьБанка.Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.NovaPay И ЗначениеЗаполнено(УчетнаяЗаписьБанка.ИД) Тогда
		ЭтаФорма.Элементы.РасшифровкаПлатежаОтАгентаПолучитьДанныеСНовопей.Видимость = Истина;
	Иначе                                                                                     
		ЭтаФорма.Элементы.РасшифровкаПлатежаОтАгентаПолучитьДанныеСНовопей.Видимость = Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СМП_ПолучитьДанныеСНовопейПосле(Команда)
	СМП_ПолучитьДанныеСНовопейПослеНаСервере();
КонецПроцедуры   

&НаКлиенте
Процедура СМП_БанковскийСчетПриИзмененииПосле(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СМП_ПриОткрытииПосле(Отказ)
	ОбновитьВидимость();
КонецПроцедуры
